Readme has clear diagrram tested in github
